In [5]:
import pandas as pd
import numpy as np

In [16]:
person_data = [(1,'rohit',25,'Himachal Pardesh'),(2,'shiwam',27,'Bihar'),(3,'abhishek',25,"Punjab"),(4,'sahil',24,'Himachal Pardesh')]
pd.DataFrame(person_data, columns  = ['id','name','age','address'])

   id      name  age           address
0   1     rohit   25  Himachal Pardesh
1   2    shiwam   27             Bihar
2   3  abhishek   25            Punjab
3   4     sahil   24  Himachal Pardesh

In [ ]:
df =pd.DataFrame({"Name": ["abc", "bcd", "efg"], 'Rollno':[2,3,4] , 'Marks': [ 23,45,56]})

  Name  Rollno  Marks
0  abc       2     23
1  bcd       3     45
2  efg       4     56

# Data Filtering

In [20]:
filtered_data = df[df['age']<=25]
print(filtered_data)

   id      name  age           address
0   1     rohit   25  Himachal Pardesh
2   3  abhishek   25            Punjab
3   4     sahil   24  Himachal Pardesh

In [36]:
fil_data = df.query("age <=25 and address == 'Himachal Pardesh'")
print(fil_data)

   id   name  age           address    phone
0   1  rohit   25  Himachal Pardesh  8384394
3   4  sahil   24  Himachal Pardesh  8384394

In [37]:
df['phone'] = [8384394,3408304,3429834,38478374]

In [38]:
df['phone'] = 8384394

In [39]:
print(df)

   id      name  age           address    phone
0   1     rohit   25  Himachal Pardesh  8384394
1   2    shiwam   27             Bihar  8384394
2   3  abhishek   25            Punjab  8384394
3   4     sahil   24  Himachal Pardesh  8384394

In [44]:
df.drop(columns=['phone'])

   id      name  age           address
0   1     rohit   25  Himachal Pardesh
1   2    shiwam   27             Bihar
2   3  abhishek   25            Punjab
3   4     sahil   24  Himachal Pardesh

In [50]:
#to insert at specific colums

df.insert(2,'pho',287439843)

In [51]:
print(df)

   id      name        pho       phoe  age           address    phone
0   1     rohit  287439843  287439843   25  Himachal Pardesh  8384394
1   2    shiwam  287439843  287439843   27             Bihar  8384394
2   3  abhishek  287439843  287439843   25            Punjab  8384394
3   4     sahil  287439843  287439843   24  Himachal Pardesh  8384394

In [52]:
del df['pho']

In [53]:
del df['phoe']

In [54]:
print(df)

   id      name  age           address    phone
0   1     rohit   25  Himachal Pardesh  8384394
1   2    shiwam   27             Bihar  8384394
2   3  abhishek   25            Punjab  8384394
3   4     sahil   24  Himachal Pardesh  8384394

In [56]:
df = df.drop(3)

In [57]:
print(df)

   id      name  age           address    phone
0   1     rohit   25  Himachal Pardesh  8384394
1   2    shiwam   27             Bihar  8384394
2   3  abhishek   25            Punjab  8384394